{
  "profile": {
    "name": "BEMELINGUE Wilfried",
    "title": "Étudiant en génie informatique spécialisé en IA, Deep Learning et Machine Learning",
    "summary": "Actuellement à la recherche d’un stage de fin d’études (6 mois) dans le domaine de l’intelligence artificielle, du Deep Learning et du Machine Learning. Je réside en France, en Île-de-France, et je suis parfaitement bilingue en français et possède un anglais courant (TOEIC en cours).",
    "location": "Île-de-France, France",
    "email": "wilfriedbemelingue@gmail.com",
    "phone": "07 76 34 90 99",
    "linkedin": "https://www.linkedin.com/in/wilfried-bemelingue",
    "github": "https://github.com/Wildrey237",
    "cvLink": "https://drive.google.com/file/d/1xs_jetonCkWGsecy88F8G78ry0T6vWLr/view?usp=share_link"
  },
  "experiences": [
    {
      "title": "Stagiaire – Optimisation et migration de scripts",
      "company": "COMUTITRES (Île-de-France Mobilités)",
      "dates": "Septembre 2024 – Février 2025",
      "description": "Migration de scripts vers Airflow sur AWS, optimisation de scripts Python et requêtes SQL, mise en place d’un système de relance automatique basé sur JSON, création de KPI pour la BI, amélioration des pipelines CI/CD sous GitLab.",
      "tags": [
        "Python",
        "Airflow",
        "AWS",
        "SQL",
        "CI/CD"
      ]
    },
    {
      "title": "Stagiaire Développeur",
      "company": "TDA CERMAI Villiers-le-Bel",
      "dates": "Avril 2023 – Juillet 2023",
      "description": "Amélioration et finalisation de l'application d'affichage des frets aériens initiée lors du stage précédent. Développement de modules de monitoring avancés pour les opérations Import/Export, intégration de données en temps réel avec ObjectScript, visualisation dynamique via Iris Intersystems et Python. Participation à l’optimisation des performances, à l'interface utilisateur et à la documentation technique.",
      "tags": [
        "JavaScript",
        "ObjectScript",
        "Iris Intersystems",
        "DataViz",
        "Python",
        "Monitoring",
        "Optimisation",
        "Documentation"
      ]
    },
    {
      "title": "Stagiaire – Développement d’interfaces API",
      "company": "TDA CERMAI Villiers-le-Bel",
      "dates": "Mai 2022 – Juin 2022",
      "description": "Participation à la création d’une application web affichant les flux de fret aérien, connectée à une API REST. Intégration dynamique des données en JavaScript, amélioration de la lisibilité des interfaces, tests fonctionnels, et contribution à la documentation technique.",
      "tags": [
        "JavaScript",
        "REST API",
        "Développement web",
        "Documentation",
        "Tests fonctionnels"
      ]
    },
    {
      "title": "Stagiaire",
      "company": "INNOVATECH Yaoundé",
      "dates": "Juin 2019 – Août 2019",
      "description": "Formation Arduino et mécatronique, réalisation d'un Smart Parking et d'une voiture télécommandée.",
      "tags": [
        "Arduino",
        "Mécatronique",
        "IoT"
      ]
    }
  ],
  "skills": {
    "development": [
      {
        "name": "HTML, CSS, JavaScript, TypeScript",
        "desc": "Technologies de base pour créer des interfaces web modernes et responsives."
      },
      {
        "name": "React, Node.js",
        "desc": "Framework et runtime pour créer des applications web dynamiques côté client et serveur."
      },
      {
        "name": "Python (NumPy, Pandas, PyTorch)",
        "desc": "Langage polyvalent pour le data science, l'IA et le machine learning."
      },
      {
        "name": "Java, PHP, C/C++",
        "desc": "Langages pour le développement back-end, embarqué et logiciels complexes."
      }
    ],
    "environments": [
      {
        "name": "Docker",
        "desc": "Création et gestion de conteneurs pour déployer des applications de façon portable."
      },
      {
        "name": "Kubernetes",
        "desc": "Orchestration de conteneurs pour gérer des applications à grande échelle."
      },
      {
        "name": "Linux (administration et scripting)",
        "desc": "Environnement système utilisé pour le développement et la mise en production."
      }
    ],
    "databases": [
      {
        "name": "SQL (MySQL, PostgreSQL)",
        "desc": "Langages de requête pour interroger et gérer des bases de données relationnelles."
      },
      {
        "name": "NoSQL",
        "desc": "Bases de données flexibles pour gérer des données non structurées."
      },
      {
        "name": "Neo4j (bases de données graphes)",
        "desc": "Base de données optimisée pour les relations complexes entre entités."
      }
    ],
    "ai": [
      {
        "name": "Machine Learning & Deep Learning",
        "desc": "Conception et entraînement de modèles intelligents à partir de données."
      },
      {
        "name": "Graph Neural Networks",
        "desc": "Réseaux de neurones conçus pour traiter des données sous forme de graphes."
      },
      {
        "name": "Reinforcement Learning",
        "desc": "Apprentissage par interaction pour optimiser des décisions séquentielles."
      },
      {
        "name": "IA Explicable (SHAP, LIME)",
        "desc": "Techniques permettant d’expliquer les décisions des modèles d’IA."
      }
    ],
    "bigdata": [
      {
        "name": "Hadoop, Spark, MapReduce",
        "desc": "Outils pour le traitement distribué de données volumineuses."
      },
      {
        "name": "Airflow sur AWS",
        "desc": "Orchestration et automatisation de workflows dans le cloud."
      },
      {
        "name": "CI/CD avec GitLab et GitHub",
        "desc": "Mise en place de pipelines de déploiement et d’intégration continue."
      }
    ],
    "quantum": [
      {
        "name": "Mathématiques quantiques",
        "desc": "Bases mathématiques appliquées à l’informatique quantique et à la modélisation de systèmes."
      },
      {
        "name": "Informatique quantique",
        "desc": "Fort intérêt pour les principes de calcul quantique, les algorithmes et les technologies émergentes dans ce domaine."
      }
    ]
  },
  "education": [
    {
      "school": "EPITA – Spécialisation SCIA‑G (Campus de Lyon) FR",
      "degree": "Majeure Smart Computing for Artificial Graphs (4ᵉ et 5ᵉ années, dernière année en cours, accréditée par la CTI)",
      "years": "2024 – 2025",
      "details": "La majeure SCIA‑G forme des ingénieurs capables de concevoir et d’appliquer des intelligences artificielles sur des données structurées en graphes. Elle couvre la data‑viz, le big data, le machine learning, les systèmes distribués et les algorithmes de recommandation, avec des projets complexes et une forte orientation vers la recherche et l’innovation.",
      "website": "https://www.epita.fr",
      "projects": [
        {
          "title": "Analyse et prédiction des accidents de la route",
          "description": "Projet combinant data‑viz, big data et machine learning : traitement et analyse de données d’accidents, modélisation supervisée et non supervisée, évaluation de modèles et interprétation des résultats."
        },
        {
          "title": "Projet TinyX (INFO8)",
          "description": "Implémentation d’une architecture micro‑services en Java (Quarkus) avec bases NoSQL (MongoDB, Elasticsearch, Neo4j), files de messages Redis et déploiement Kubernetes."
        },
        {
          "title": "Programmation différentiable",
          "description": "Reconstruction d’une librairie de deep learning type PyTorch pour comprendre le calcul différentiel automatique et la rétropropagation."
        },
        {
          "title": "Deep Learning – Classification de galaxies",
          "description": "Conception d’un réseau de neurones pour classifier des galaxies (jeu de données Galaxy10‑DECals), entraînement et évaluation des performances."
        },
        {
          "title": "NLP – Filtre intelligent de CV",
          "description": "Création d’un outil de filtrage automatique de CV pour les recruteurs utilisant des techniques NLP avancées."
        },
        {
          "title": "Recommender Systems",
          "description": "Mise en œuvre d’algorithmes de recommandation et introduction de diversité dans les recommandations (ItemKNN, UserKNN, SVD et techniques de diversification)."
        }
      ]
    },
    {
      "school": "EPITA Le Kremlin‑Bicêtre FR",
      "degree": "Diplôme d’ingénieur en Informatique (3ᵉ année, accrédité par la CTI)",
      "years": "Depuis septembre 2023",
      "details": "En 3ᵉ année du cycle ingénieur, les étudiants suivent des piscines intensives (séances de programmation de plusieurs jours, parfois nocturnes), ainsi que des projets collectifs et des challenges « rush ». Cette pédagogie immersive vise à renforcer les compétences fondamentales, développer la robustesse et simuler des environnements professionnels exigeants.",
      "website": "https://www.epita.fr",
      "projects": [
        {
          "title": "Mini Shell en C",
          "description": "Conception et développement d’un mini shell."
        },
        {
          "title": "Compilateur en C++",
          "description": "Création d’un compilateur complet en C++."
        },
        {
          "title": "Jeux vidéo",
          "description": "Création de jeux : Zorks en C++, Creeps en Java, Eplace en JavaScript."
        },
        {
          "title": "Éditeur de code",
          "description": "Développement d’un éditeur de code en Java et React."
        },
        {
          "title": "Étude opérationnelle du déneigement de Montréal",
          "description": "Analyse et modélisation en Python."
        },
        {
          "title": "Classification de données médicales",
          "description": "Conception et entraînement de modèles de machine learning en Python pour classifier des données médicales. Mise en œuvre d’analyses exploratoires, d’un prétraitement avancé, d’algorithmes supervisés (régressions, forêts aléatoires, réseaux de neurones) et évaluation des performances avec des métriques adaptées."
        }
      ]
    },
    {
      "school": "ECE Paris FR",
      "degree": "2ᵉ année Bachelor RNCP",
      "years": "Septembre 2022 – Avril 2023",
      "details": "Formation orientée développement logiciel et analyse de données, avec mise en pratique sur des projets concrets.",
      "website": "https://www.ece.fr",
      "projects": [
        {
          "title": "Applications web PHP",
          "description": "Conception et développement d’applications web en PHP."
        },
        {
          "title": "Portfolio React.js",
          "description": "Réalisation d’un portfolio en React.js."
        },
        {
          "title": "Applications Java",
          "description": "Développement d’applications complètes en Java."
        },
        {
          "title": "Analyse de données",
          "description": "Traitement et analyse de données avec Python (Pandas, NumPy)."
        }
      ]
    },
    {
      "school": "EPSI Rennes FR",
      "degree": "1ʳᵉ année Bachelor RNCP",
      "years": "Septembre 2021 – Avril 2022",
      "details": "Première approche des systèmes informatiques et du développement web et objet, avec de nombreux projets techniques.",
      "website": "https://www.epsi.fr",
      "projects": [
        {
          "title": "Serveur web Linux",
          "description": "Création, virtualisation et administration de serveurs web sous Linux."
        },
        {
          "title": "Applications Flask/PHP/Python",
          "description": "Développement d’applications web et objets avec Flask, PHP et Django."
        },
        {
          "title": "Administration réseau",
          "description": "Mise en place et gestion d’infrastructures réseau."
        }
      ]
    },
    {
      "school": "Université Saint Jean – Yaoundé CMR",
      "degree": "Classe préparatoire ingénieur",
      "years": "Octobre 2020 – Juin 2021",
      "details": "Préparation intensive en mathématiques, physique et robotique pour intégrer une école d’ingénieur.",
      "website": "https://institutsaintjean.org",
      "projects": [
        {
          "title": "Projets Arduino",
          "description": "Réalisation de prototypes robotiques et électroniques."
        }
      ]
    }
  ]
}