{
  "profile": {
    "name": "BEMELINGUE Wilfried",
    "title": "Computer Engineering Student specialized in AI, Deep Learning, and Machine Learning",
    "summary": "Currently seeking a 6-month end-of-studies internship in Artificial Intelligence, Deep Learning, or Machine Learning. Based in Île-de-France, France. Fully bilingual in French and fluent in English (TOEIC in progress).",
    "location": "Île-de-France, France",
    "email": "wilfriedbemelingue@gmail.com",
    "phone": "+33 7 76 34 90 99",
    "linkedin": "https://www.linkedin.com/in/wilfried-bemelingue",
    "github": "https://github.com/Wildrey237",
    "cvLink": "https://drive.google.com/file/d/1yQDQyEmey_TYXdFwEm-sIHMLacKJD_Jk/view?usp=share_link"
  },
  "experiences": [
    {
      "title": "Intern – Data Engineer (DataFactory Team)",
      "company": "COMUTITRES (Île-de-France Mobilités)",
      "dates": "September 2024 – February 2025",
      "description": "As a DataFactory team intern at COMUTITRES (Île-de-France Mobilités), I contributed to the redesign of data processing pipelines.\n\nMain missions:\n• Migration of data processing scripts to Apache Airflow deployed on AWS\n• Task automation using JSON-based workflows\n• Optimization of Python scripts and SQL queries\n• Design of performance indicators (KPI) for Business Intelligence\n• Reinforcement of CI/CD pipelines using GitLab\n\nThis experience in an agile data environment strengthened my skills in data engineering, cloud computing, and workflow orchestration.",
      "tags": [
        "Python",
        "SQL",
        "Airflow",
        "AWS",
        "JSON",
        "CI/CD",
        "GitLab",
        "Business Intelligence",
        "Data Engineering"
      ]
    },
    {
      "title": "Intern – Web Application for Logistics Tracking",
      "company": "TDA CERMAI (Toullec Dancoing & Associés)",
      "dates": "April 2023 – July 2023",
      "description": "Contributed to the enhancement and finalization of a web application for monitoring air freight logistics (import/export).\n\nMain missions:\n• Migration of the database from InterSystems Caché to InterSystems IRIS\n• Development of a front-end interface for displaying logistics statistics\n• Creation of REST APIs in ObjectScript and Python, directly integrated with the IRIS database\n• Administration and configuration of the InterSystems IRIS server\n• Migration of internal tools to next-generation technologies\n• Drafting of technical documentation for internal teams and clients",
      "tags": [
        "JavaScript",
        "ObjectScript",
        "InterSystems IRIS",
        "REST API",
        "Python",
        "Database",
        "Documentation",
        "Front-end",
        "Data Visualization"
      ]
    },
    {
      "title": "Intern – API Interface Development",
      "company": "TDA CERMAI Villiers-le-Bel",
      "dates": "May 2022 – June 2022",
      "description": "Participated in the development of a web application displaying air freight flows connected to a REST API. Integrated real-time data using JavaScript, improved interface usability, conducted functional tests, and contributed to technical documentation.",
      "tags": [
        "JavaScript",
        "REST API",
        "Web Development",
        "Documentation",
        "Functional Testing"
      ]
    },
    {
      "title": "Intern",
      "company": "INNOVATECH Yaoundé",
      "dates": "June 2019 – August 2019",
      "description": "Arduino and mechatronics training. Designed and built a Smart Parking system and a remote-controlled car.",
      "tags": [
        "Arduino",
        "Mechatronics",
        "IoT"
      ]
    }
  ],
  "skills": {
    "development": [
      {
        "name": "HTML, CSS, JavaScript, TypeScript",
        "desc": "Core technologies for building modern, responsive web interfaces."
      },
      {
        "name": "React, Node.js",
        "desc": "Framework and runtime for building dynamic web applications on both client and server sides."
      },
      {
        "name": "Python (NumPy, Pandas, PyTorch)",
        "desc": "Versatile programming language for data science, AI, and ML. Used for modeling, data preprocessing, and pipeline automation."
      },
      {
        "name": "Java, PHP, C/C++",
        "desc": "Languages for backend, embedded, and complex software development."
      },
      {
        "name": "R",
        "desc": "Used for advanced statistics and analytical visualizations in data science contexts."
      }
    ],
    "environments": [
      {
        "name": "Docker",
        "desc": "Containerization for consistent, portable application deployment."
      },
      {
        "name": "Kubernetes",
        "desc": "Container orchestration for scalable, distributed applications."
      },
      {
        "name": "Linux (Administration & Scripting)",
        "desc": "System environment for development and production deployment."
      },
      {
        "name": "MLOps (MLflow, CI/CD)",
        "desc": "Model deployment, experiment tracking, and CI/CD integration for ML workflows."
      }
    ],
    "databases": [
      {
        "name": "SQL (MySQL, PostgreSQL)",
        "desc": "Query languages for managing relational databases."
      },
      {
        "name": "NoSQL (MongoDB, Elasticsearch)",
        "desc": "Flexible databases for managing unstructured or distributed data."
      },
      {
        "name": "Neo4j (Graph Databases)",
        "desc": "Graph-based data modeling for relationship-heavy datasets, used in GNN projects."
      }
    ],
    "ai": [
      {
        "name": "Machine Learning & Deep Learning",
        "desc": "Supervised and unsupervised modeling, neural networks, regressions, decision trees, and clustering."
      },
      {
        "name": "Graph Neural Networks (GNN)",
        "desc": "Deep neural architectures for graph-structured data: message passing, link prediction, graph convolution, and embeddings."
      },
      {
        "name": "Reinforcement Learning",
        "desc": "Reward-based learning through exploration/exploitation methods such as Q-learning and policy iteration."
      },
      {
        "name": "Explainable AI (XAI)",
        "desc": "Model interpretability techniques such as SHAP and LIME, with emphasis on robustness and fairness analysis."
      },
      {
        "name": "Medical AI",
        "desc": "Processing of medical imaging data (DICOM, METS) using MONAI and PyTorch for classification, segmentation, and metric evaluation (dice, recall)."
      }
    ],
    "bigdata": [
      {
        "name": "Hadoop, Spark, MapReduce",
        "desc": "Distributed data processing frameworks for large-scale datasets."
      },
      {
        "name": "Apache Airflow on AWS",
        "desc": "Workflow orchestration and scheduling for cloud-based data processing pipelines."
      },
      {
        "name": "CI/CD (GitLab/GitHub)",
        "desc": "Automated deployment and continuous integration pipelines for software and ML projects."
      }
    ],
    "dataviz": [
      {
        "name": "Tableau, Power BI",
        "desc": "Creation of interactive dashboards for business and analytical insights."
      },
      {
        "name": "Python Libraries (Matplotlib, Seaborn, Plotly)",
        "desc": "Data visualization, exploratory analysis, and interactive dashboards in Python."
      }
    ],
    "quantum": [
      {
        "name": "Quantum Mathematics",
        "desc": "Mathematical foundations applied to quantum computing and system modeling."
      },
      {
        "name": "Quantum Computing",
        "desc": "Strong interest in quantum algorithms, principles of quantum information, and emerging quantum technologies."
      }
    ]
  },
  "education": [
    {
      "school": "EPITA – Specialization SCIA‑G (Lyon Campus) FR",
      "degree": "Major in Smart Computing for Artificial Graphs (4th and 5th years, final year in progress, CTI accredited)",
      "years": "2024 – 2025",
      "details": "The SCIA‑G major trains engineers to design and implement artificial intelligence systems on graph-structured data. The curriculum includes advanced machine learning, graph neural networks (GNN), explainable AI (XAI), reinforcement learning, medical data processing, MLOps, stochastic modeling, and continuous optimization. The pedagogy is based on real-world projects and research-oriented challenges.",
      "website": "https://www.epita.fr",
      "projects": [
        {
          "title": "Traffic Accident Prediction and Analysis",
          "description": "Data‑viz, big data, and machine learning project analyzing and modeling accident data to detect risk factors and predict accident probability."
        },
        {
          "title": "TinyX Project (INFO8)",
          "description": "Implementation of a microservices architecture in Java (Quarkus) using NoSQL databases (MongoDB, Elasticsearch, Neo4j), Redis messaging queues, and Kubernetes deployment."
        },
        {
          "title": "Differentiable Programming",
          "description": "Recreation of a PyTorch‑like deep learning library to understand automatic differentiation and backpropagation mechanisms."
        },
        {
          "title": "Galaxy Classification",
          "description": "CNN‑based image classification project using the Galaxy10‑DECals dataset to evaluate model accuracy and performance."
        },
        {
          "title": "NLP CV Filter",
          "description": "Automated CV filtering system for recruiters using NLP and ML techniques for text parsing and scoring."
        },
        {
          "title": "Recommender Systems",
          "description": "Implementation of collaborative filtering algorithms (ItemKNN, UserKNN, SVD) with diversification mechanisms."
        },
        {
          "title": "Medical ML",
          "description": "Medical data classification and segmentation using MONAI and PyTorch, metric evaluation (dice score, recall)."
        },
        {
          "title": "Explainable AI",
          "description": "Evaluation of model explainability tools (SHAP, LIME) with robustness and uncertainty analysis."
        },
        {
          "title": "Reinforcement Learning",
          "description": "Q‑learning and stochastic policy implementations for simulation environments, games, and autonomous agents."
        }
      ]
    }
  ]
}